app/controllers/home_controller.rb

  def new
       @posts = Post.all
---
SELECT "posts".* FROM "posts"

  def create
    @post = Post.new
    @post.title = params[:post_title]
    @post.content = params[:post_content]
    @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "되나"], ["content", "해볼까?"], ["created_at", "2018-04-08 03:54:40.243362"], ["updated_at", "2018-04-08 03:54:40.243362"]]

   def delete
    @post = Post.find(params[:post_id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

   def edit
     @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]

   def update
     @post = Post.find(params[:post_id])
     @post.title = params[:post_title]
     @post.content = params[:post_content]
     @post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "될지어다 --수정"], ["content", "될지어다 --수정"], ["updated_at", "2018-04-10 10:46:57.827989"], ["id", 23]]